In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import warnings
warnings.simplefilter(action='ignore')

pd.set_option('display.float_format', lambda x: '%.2f' % x)


from sklearn.model_selection import StratifiedKFold
from sklearn.metrics import mean_absolute_error, mean_squared_error ,r2_score
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split, cross_val_score

In [8]:
df = pd.read_csv('Salary_Data.csv')
sal = df['Salary']
exp=df['YearsExperience']
df=pd.DataFrame({'EXPERIENCE':exp,'SALARY':sal})
df

    EXPERIENCE  SALARY
0         1.10   39343
1         1.30   46205
2         1.50   37731
3         2.00   43525
4         2.20   39891
5         2.90   56642
6         3.00   60150
7         3.20   54445
8         3.20   64445
9         3.70   57189
10        3.90   63218
11        4.00   55794
12        4.00   56957
13        4.10   57081
14        4.50   61111
15        4.90   67938
16        5.10   66029
17        5.30   83088
18        5.90   81363
19        6.00   93940
20        6.80   91738
21        7.10   98273
22        7.90  101302
23        8.20  113812
24        8.70  109431
25        9.00  105582
26        9.50  116969
27        9.60  112635
28       10.30  122391
29       10.50  121872
30        7.10   63218
31        7.90   55794
32        2.00   56957

In [9]:
df.head()

   EXPERIENCE  SALARY
0        1.10   39343
1        1.30   46205
2        1.50   37731
3        2.00   43525
4        2.20   39891

In [10]:
df.describe()

       EXPERIENCE    SALARY
count       33.00     33.00
mean         5.35  74426.03
std          2.82  26603.29
min          1.10  37731.00
25%          3.20  56642.00
50%          4.90  63218.00
75%          7.90  98273.00
max         10.50 122391.00